package cn.org.nercita.agriculturalconsultant.main.bean;

import java.util.List;

/**
 * Created by 梁兴胜 on 2017/4/13.
 * 最新资讯更多列表数据
 */

public class LawsListBean {

    /**
     * page : {"hasPrePage":false,"hasNextPage":true,"everyPage":15,"totalPage":2,"currentPage":1,"beginIndex":0,"totalCount":18,"data":null,"datas":null}
     * content : [{"id":38,"title":"上半年主要农作物病虫害发生趋势","content":"根据各县（市）区植保站在2月24日至3月1日对主要农作物病虫害越冬基数调查结果，结合历年资料、参照气象资料对今年上半年我市主要农作物病虫害发生趋势预测。","creattime":"2017-04-06","urlFiles":"/resources/uploads/laws/file/201704/20170406170014_832.zip","type":1,"url":"","urlPics":""},{"id":39,"title":"河北省今年小麦墒情为近年来最好","content":"去冬今春，河北省降水条件好，小麦墒情为近年最好的一年。河北省气象局统计显示，冬小麦越冬前，河北省降水充沛，有效补充了土壤水分，小麦形成了冬前壮苗，足墒进入越冬期。越冬期之后，出现了4次明显降雪过程，北部降水量比","creattime":"2017-04-06","urlFiles":null,"type":null,"url":null,"urlPics":null},{"id":40,"title":"韩长赋就国务院《关于建立粮食生产功能区和重要农产品生产保护区的指导意见》答记者问","content":"落实藏粮于地、藏粮于技战略\r\n\r\n增强粮食和重要农产品供给保障能力\r\n\r\n\u2014\u2014农业部部长韩长赋就国务院《关于建立粮食生产功能区和重要农产品生产保护区的指导意见》答记者问\r\n\r\n　　本网讯  近日，国务院发布《关于建立粮食生产功能区和重要农产品生产保护区的指导意见》（以下简称《意见》），对建立粮食生产功能区和重要农产品生产保护区（以下简称\u201c两区\u201d）进行了总体部署。日前，农业部部长韩长赋就《意见》出台的背景、总体目标、如何推动建立\u201c两区\u201d等问题，接受了记者专访。\r\n\r\n　　记者：近几年的中央有关文件中曾提到过\u201c两区\u201d的概念，但总体而言，\u201c两区\u201d还是一个新名词、新事物，我们该怎么认识和理解\u201c两区\u201d？\r\n\r\n　　韩长赋：《意见》明确\u201c两区\u201d是指粮食生产功能区和重要农产品生产保护区，包括稻谷、小麦、玉米三大谷物粮食生产功能区和大豆、棉花、油菜籽、糖料蔗、天然橡胶等五类重要农产品生产保护区。建设粮食生产功能区的概念是2010年浙江省最先提出并着手实施的，目的是在浙江这样的粮食主销省，要划定800万亩耕地，建设并固定其粮食生产功能，以保障一定的粮食自给率。从浙江的实践看，是可靠可行的。国家层面有一个从探索思考到基本成熟和工作部署的过程。2015年的中央一号文件就提出要\u201c探索建立粮食生产功能区，将口粮生产能力落实到田块地头、保障措施落实到具体项目\u201d，党的十八届五中全会通过的\u201c十三五\u201d规划建议，再次明确\u201c探索建立粮食生产功能区和重要农产品生产保护区\u201d，这一阶段的主要工作是探索和研究。此后，2016年的中央一号文件要求\u201c制定划定粮食生产功能区和大豆、棉花、油料、糖料蔗等重要农产品生产保护区的指导意见\u201d，2016年第十二届全国人民代表大会第四次会议审议通过 \u201c十三五\u201d规划纲要进一步明确 \u201c建立粮食生产功能区和重要农产品生产保护区，确保稻谷、小麦等口粮种植面积基本稳定\u201d，这一阶段主要是研究制定国家层面的政策制度来规范建立\u201c两区\u201d。在此基础上，2017年中央一号文件提出，科学合理划定稻谷、小麦、玉米粮食生产功能区和大豆、棉花、油菜籽、糖料蔗、天然橡胶等重要农产品生产保护区，要求落实政策来划定建立\u201c两区\u201d。\r\n\r\n　　总的看，在历经多年种植结构调整后，农作物种植区域布局基本稳定，建立\u201c两区\u201d本质上是把种植粮食和重要农产品的优势区域相对固定下来，以生产粮食等主要农产品为功能，实施差别化、定向化扶持政策，进一步优化农业生产结构和区域布局。建立\u201c两区\u201d也是农产品主体功能区在农业领域的进一步细化落实，对于巩固提升粮食和重要农产品供给保障能力，掌握战略主动权，具有重要意义。\r\n\r\n　　记者：国务院发布《意见》，推动在全国范围内建立\u201c两区\u201d，主要是出于什么考虑？\u201c两区\u201d的建立，对于粮食和农业生产将发挥哪些作用？\r\n\r\n　　韩长赋：《意见》在\u201c指导思想\u201d中明确，建立\u201c两区\u201d要深入贯彻习近平总书记治国理政新理念新思想新战略，牢固树立和贯彻落实新发展理念，实施藏粮于地、藏粮于技战略，以确保国家粮食等重要农产品有效供给为目标，以深入推进农业供给侧结构性改革为主线，以主体功能区规划和优势农产品区域布局为依托，以永久基本农田为基础，将\u201c两区\u201d落实到具体地块，优化区域布局和要素组合，促进农业结构调整，提升农产品质量效益和市场竞争力，为推进农业现代化建设、全面建成小康社会奠定坚实基础。推动建立\u201c两区\u201d主要有三方面考虑：\r\n\r\n　　一是落实藏粮于地、藏粮于技战略，确保谷物基本自给、口粮绝对安全。近年来，我国粮食连年增产，棉油糖等重要农产品供给充足，但工业化、城镇化发展与农业生产用水用地矛盾不断凸显，直接影响国家粮食安全和农业可持续发展。以关系国计民生的粮食等重要农产品为重点，以耕地保护红线、永久基本农田为基础，在水土资源环境条件较好、农业基础设施比较完善的优势产区，划定并建设\u201c两区\u201d，增强粮食和重要农产品供给保障能力，是落实新时期国家粮食安全战略的重大举措。二是推进供给侧结构性改革，优化农业区域布局。随着我国经济社会发展进入新常态，农产品供求关系发生了深刻变化，部分农产品阶段性供过于求与品种结构矛盾并存，必须大力推进农业供给侧结构性改革。通过建立\u201c两区\u201d，进一步聚焦核心品种和优势产区，将粮食等重要农产品生产用地细化落实到地块，优化区域布局和要素组合，可以为农业结构战略性调整和提高农产品市场竞争力提供坚实支撑。三是完善农业调控方式，推进农业现代化。我国农业生产科技水平不高，主要农作物耕种收综合机械化率较低，农业生产方式和管理方式比较粗放。以\u201c两区\u201d为平台，推动农业科技集成和推广应用，创新农业发展机制，有利于推动建立现代农业产业体系、生产体系和经营体系，引领全国现代农业建设，有利于完善农业宏观调控方式，实现国家强农惠农政策精准定位、精准施策、精准监测和精准评价，更好地调动地方政府和农民发展粮棉油糖生产积极性。\r\n\r\n　　记者：\u201c两区\u201d建设是一项系统工程，涉及方方面面的工作，其中最主要的抓手、最核心的工作任务是什么？\r\n\r\n　　韩长赋：《意见》对建立\u201c两区\u201d作出了系统部署，从划定、建设、监管和政策支持、组织领导都明确了思路、路径、措施，核心就是四个字\u201c划、建、管、护\u201d。划：按照《意见》确定的划定标准和程序，在3年内划定粮食生产功能区9亿亩、重要农产品生产保护区2.38亿亩，扣除复种、重叠面积，\u201c两区\u201d耕地面积10.4亿亩，占现有耕地面积20.3亿亩的51.2%，占永久基本农田面积15.46亿亩的67.3%。确保将优质耕地稳定地用于粮棉油糖等重要农产品生产。建：以\u201c两区\u201d为载体，按照集中连片、旱涝保收、稳产高产、生态友好的要求，大规模推进高标准农田建设。加大新型主体培育，发展多种形式的适度规模经营，构建覆盖全程、综合配套、便捷高效的农业社会化服务体系，提升推广服务能力，整体提升\u201c两区\u201d综合生产能力。管：严格按照基本农田保护条例等相关法律法规，管控\u201c两区\u201d用途。充分应用现代信息技术，做到\u201c两区\u201d地块全部建档立册、上图入库，形成粮棉油糖等重要农产品种植结构全国\u201c一张图\u201d，实施精准化、动态化管理。护：通过加大对\u201c两区\u201d的政策支持，增加基础建设投入，完善财政政策，创新金融支持政策，形成有力度、有约束的政策体系，激励和引导地方政府和农户重农抓粮不吃亏、得实惠，确保\u201c两区\u201d持续稳定发展。\r\n\r\n　　通过努力，争取用3年时间完成划定工作，\u201c两区\u201d内的粮食作物和重要农产品种植全部实现信息化、精准化管理；用5年时间基本完成建设工作，形成布局合理、设施完善、产能提升、管护到位、生产现代化的\u201c两区\u201d，国家粮食安全的根基更加稳固，棉油糖等重要农产品自给水平保持稳定，农业产业安全掌控能力全面增强。\r\n\r\n　　记者：《意见》中提出要划定粮食生产功能区9亿亩，重要农产品生产保护区2.38亿亩，请问确定这个数字的主要依据是什么？\r\n\r\n　　韩长赋：《意见》强调要坚持\u201c底线思维、科学划定，统筹兼顾、持续发展，政策引导、农民参与，完善机制、建管并重\u201d，并明确划定粮食功能区9亿亩、重要农产品生产保护区2.38亿亩，主要是着眼于贯彻落实国家粮食安全战略和保障重要农产品有效供给，结合供需形势预判和生产形势分析进行划定。按照新时期国家粮食安全战略，以稻麦两大口粮自给率100%和玉米、水稻、小麦三大谷物自给率保持在95%左右为目标，测算了粮食生产功能区9亿亩划定面积，其中，6亿亩用于口粮生产。即，划出现有稻麦用地面积83%，实现保障95%的口粮产量；划出现有三大谷物用地面积80%，实现保障90%以上的谷物自给率。加上\u201c两区\u201d之外的产能，\u201c口粮绝对安全、谷物基本自给\u201d就有充分的保障。同时，按照发挥比较优势、优化种植结构、稳定农民收益的思路，测算划定重要农产品生产保护区2.38亿亩，可确保现有供给水平不降低。其中，大豆保护区1亿亩、油菜保护区7000万亩、棉花保护区3500万亩、糖料蔗保护区1500万亩。确定\u201c划定\u201d目标时，兼顾了立地条件（如粮食生产功能区要求15度坡度以下）、粮棉油糖不同品种的复种、各省生产现状与潜力等因素。此外，按照战略性物资生产调控的有关要求，《意见》提出在海南、云南、广东等省，择优划定天然橡胶生产保护区1800万亩。\r\n\r\n　　记者：什么样的耕地将被划为\u201c两区\u201d？在划定工作中，我们将采取什么标准？如何去推动划定任务的落实？\r\n\r\n　　韩长赋：《意见》明确了科学合理划定\u201c两区\u201d的标准，即：水土资源条件较好，坡度在15度以下的永久基本农田；相对集中连片，原则上平原地区连片面积不低于500亩，丘陵地区连片面积不低于50亩；农田灌排工程等农业基础设施比较完备，生态环境良好，未列入退耕还林还草、还湖还湿、耕地休耕试点等范围；具有粮食和重要农产品的种植传统，近三年播种面积基本稳定。优先选择已建成或规划建设的高标准农田进行\u201c两区\u201d划定。这些标准就是要确保划入\u201c两区\u201d的耕地是高产优质耕地，能够长期稳定用于粮食等重要农产品生产。\r\n\r\n　　《意见》明确划定\u201c两区\u201d采取 \u201c自上而下分解任务\u201d、\u201c以县为基础精准落地\u201d、\u201c审核和汇总划定成果\u201d。实际操作中突出抓好四方面工作：\r\n\r\n　　一是细化任务，将划定任务逐级分解落实到市县乡。按照《意见》要求，国家将根据\u201c两区\u201d划定总规模和各省（区、市）现有耕地总面积及划定永久基本农田保护面积、粮食和重要农产品种植用地面积等因素，确定各省（区、市）的划定任务。各省（区、市）应综合考虑资源禀赋、发展潜力、产销平衡等情况，将本省划定任务逐级细化分解到市、县、乡。二是划优保优，在永久基本农田内划定优质生产用地。粮食生产功能区和大豆、棉花、油菜籽、糖料蔗生产保护区在永久基本农田中划定，划入地块要符合《意见》提出的水土资源、集中连片、生态环境、基础设施、种植传统等方面基本条件，优先选择已经建成或规划建设的高标准农田进行\u201c两区\u201d划定。天然橡胶生产保护区按照有关要求划定。三是落到地块，建立\u201c两区\u201d数字化地图和数据库。按照《意见》明确的\u201c两区\u201d划定标准，以第二次全国土地调查和永久基本农田划定的图件、数据为基础，将划定任务落实到具体地块，明确地块面积以及灌排工程条件、作物类型、承包经营主体、土地流转情况等信息，统一编号，建立数字化地图和数据库。四是明确重点，把生产优势区作为划定重点区域。按照粮棉油糖种植现状面积和承担的划定任务，将产粮大县和重要农产品生产优势县作为工作重点县，加强划定工作的指导和督促，在工作经费等支持上予以倾斜，确保\u201c两区\u201d划定工作顺畅有序推进。\r\n\r\n　　记者：\u201c两区\u201d划定后，国家有哪些支持政策来促进\u201c两区\u201d建设和发展？\r\n\r\n　　韩长赋：《意见》明确，在大力推进\u201c两区\u201d建设和加大对\u201c两区\u201d政策支持两方面发力。在推进\u201c两区\u201d建设上，要把\u201c两区\u201d作为农业固定资产投资安排的重点领域，加大基础设施建设投入，加强骨干水利工程等大中型工程建设，配套完善田间工程、节水改造等基础设施建设。在完善财政支持政策上，要健全粮食主产区利益补偿机制，逐步提高\u201c两区\u201d所属县（市、区）的人均财力保障水平，推进\u201c两区\u201d范围内各类资金整合统筹使用，率先在\u201c两区\u201d范围内建立以绿色生态为导向的农业补贴制度；在创新金融支持政策上，要在符合条件的范围内探索开展粮食生产规模经营主体营销贷款试点，加大信贷支持，优先在\u201c两区\u201d范围内探索农产品价格和收入保险试点，推动\u201c两区\u201d农业生产灾害保险全覆盖。\r\n\r\n　　记者：\u201c两区\u201d划定后，怎么进行管理，以确保\u201c两区\u201d的用途不变化，切实发挥应有的作用？\r\n\r\n　　韩长赋：《意见》明确了四个方面措施，一是依法保护\u201c两区\u201d。\u201c两区\u201d耕地严格按照永久基本农田管理，严控对\u201c两区\u201d的占用。二是强化监督考核。将考核结果与相关政策支持挂钩，通过前面讲到的政策激励，引导农民种植目标作物。三是加强监测督察，保障\u201c两区\u201d用途。充分运用现代信息技术、遥感技术建立\u201c两区\u201d监测管理体系，实现动态化、精准化管理。四是落实管护责任。地方各级政府逐级签订\u201c两区\u201d管护责任书，层层落实责任。按照\u201c谁使用、谁受益、谁管护\u201d的原则，乡镇人民政府与\u201c两区\u201d地块的经营主体签订农业基础设施管护责任书，督促和指导经营主体加强设施管护。","creattime":"2017-04-06","urlFiles":null,"type":null,"url":null,"urlPics":null},{"id":41,"title":"冀州养殖业实现规模化标准化产业化","content":"冀州市下大力补强畜牧养殖业短板，推动传统养殖向现代养殖转型，投资1.2亿元，建成19个规模养殖场，其中，千头奶牛养殖场2个，奶牛发展到3000头，一年翻了两番；肉羊养殖量11万头，是过去的4倍；青贮玉米30万吨，比上年增长了6倍，初步实现了养殖业的规模化、标准化、产业化。","creattime":"2017-04-06","urlFiles":null,"type":null,"url":null,"urlPics":null},{"id":42,"title":"中国农科院召开科技创新工程全面推进期工作会议强调\r\n瞄准农业供给侧改革需求 推动科技创新再上新台阶","content":"本网讯  4月10日，中国农业科学院召开科技创新工程全面推进期工作会议。部署和启动了\u201c农作物基因大数据的分析与利用\u201d\u201c东北黑土地保护\u201d\u201c种植业绿色增产增效技术集成创新\u201d\u201c中式食品工程化技术研究\u201d等19项协同创新任务。农业部党组成员、中国农业科学院院长唐华俊出席会议并讲话。\r\n\r\n　　唐华俊强调，实施科技创新工程是引领全国农业科技率先进入世界前列的重要手段，是支撑农业供给侧结构性改革的迫切需要，也是建设世界一流农业科研院所的客观要求。各研究所要抓住重点，着力调整学科布局，把研究方向瞄准国际科学前沿和农业供给侧结构性改革的重大需求；着力推进协同创新，集全院优势力量开展协同攻关，力争在重点领域取得重大突破；着力加强团队建设，打造一流科研人才队伍；着力改进评价制度，激发和调动全院科技人员创新活力；着力统筹经费使用，集中力量办大事。院所要共同谋划，精心组织，齐心协力，推动科技创新工程再上一个台阶。\r\n\r\n　　就推进科技创新工程全面深入实施，唐华俊提出三点要求：一是再认识，增强推进科技创新工程实施的使命感责任感。院属各单位要将科技创新工程当作国家层面的科技战略工程来部署实施，站在新起点上进一步做好各项工作。二是再调整，力争科技创新工程取得突破性进展。各研究所要在已有基础上，适应新形势，对研究所定位、学科方向、科研团队进行再调整、再优化。三是再努力，共同推进科技创新工程全面实施。全院上下要更加努力学习、更加解放思想、更加用心工作、更加突出重点、更加敢于担当。\r\n\r\n　　据悉，科技创新工程自2013年启动实施以来，在稳定全院科研队伍、优化培育学科方向、引进高水平科技人员、深层次开展国际交流等方面发挥了重要作用。\r\n\r\n　　会议由中国农业科学院党组书记陈萌山主持。","creattime":"2017-04-06","urlFiles":null,"type":null,"url":null,"urlPics":null},{"id":43,"title":"2017年草原普法宣传现场活动在辽宁举办","content":"本网讯  4月8日，2017年草原普法宣传现场活动在辽宁省举办。本次活动由农业部草原监理中心、辽宁省畜牧兽医局和朝阳市人民政府联合举办，以\u201c依法保护草原 推动绿色发展\u201d为主题，旨在共同保护好草原生态环境。\r\n\r\n　　活动主办方向基层干部和农牧民群众宣讲了党中央、国务院关于生态文明建设的重大战略部署，宣传草原在生态文明建设中的战略地位，以及近年来草原保护工作进展。活动号召广大农牧民群众积极学习了解草原法律法规知识，切实做到学法、懂法、守法。同时，要求各级草原监督管理部门牢固树立\u201c绿水青山就是金山银山\u201d的理念，始终保持严厉打击草原违法犯罪行为的高压态势，发现草原违法行为涉嫌犯罪的案件，要及时移送司法机关追究刑事责任，形成共同打击草原违法行为新局面。\r\n\r\n　　活动期间正值市场大集，当地干部和农牧民群众200余人参加活动。活动主办方向基层草原监理人员赠送草原执法相关书籍，向群众发放草原法律法规宣传资料，并设立法律咨询台解答农牧民疑问。现场活动结束后，还组织开展草原普法\u201c进企业、进牧户、进校园\u201d活动。\r\n\r\n　　自2006年以来，农业部草原监理中心已连续12年举办\u201c草原普法宣传月\u201d活动，组织各地深入宣传草原法律法规，不断强化社会各界依法保护草原、爱护生态环境的意识，为加强草原保护、建设生态文明营造了良好的舆论氛围。","creattime":"2017-04-06","urlFiles":null,"type":null,"url":null,"urlPics":null},{"id":44,"title":"中国美丽乡村百佳范例在京揭晓","content":"本网讯  4月9日，中国美丽乡村百佳范例揭晓仪式暨农村改革与发展座谈会在北京举行。农业部党组成员、人事劳动司司长毕美家出席活动并讲话。\r\n\r\n　　毕美家指出，近年来，农业部按照中央决策部署，积极推进美丽乡村建设。在推进过程中，坚持以人为本、生态优先、规划先行，因地制宜制定各类乡村的创建目标，以此次获选村庄为代表的一大批生态环境优美、产业功能多元、村容景致独特、精神风貌良好的美丽乡村竞相出现，形成模式多样的美丽乡村建设新格局。他强调，推进美丽乡村建设工作，需要典型引路。这次评选推介找到了一批好典型，为全国60多万个村庄建设树起了标杆，能够充分发挥示范带动作用，是一次\u201c运用典型模式推动工作\u201d的生动实践。\r\n\r\n　　国务院参事室特约研究员、中国农产品市场协会会长张玉香在讲话中指出，美丽乡村百佳范例推介宣传活动，汇集众人的智慧，凝聚大家的力量，大力推进美丽乡村建设，促进绿色发展，这对于深入推进农业部供给侧结构性改革意义重大，影响深远。\r\n\r\n　　据了解，由中国农村杂志社主办的中国美丽乡村百佳范例宣传推介活动，自去年11月启动以来，收到来自全国各地村庄的申报材料，经两轮评委投票和网络投票，按照地域的代表性、类型的典型性、建设的先进性、参与的积极性、推荐的权威性等原则，进行了认真遴选，最后票决产生了浙江花园村、湖南开慧村等全国美丽乡村百佳范例。\r\n\r\n　　来自农业部等有关部门、中央媒体负责人、专家和获选代表等300多人出席会议。","creattime":"2017-04-06","urlFiles":null,"type":null,"url":null,"urlPics":null},{"id":45,"title":"张桃林在全国农牧渔业大县局长轮训农牧大县农业局长培训班开班式上强调\r\n深入推进农业供给侧结构性改革\r\n加快释放农业科技支撑新动能","content":"本网讯  4月7日，全国农牧渔业大县局长轮训农牧大县农业局长培训班在北京举办。农业部副部长张桃林在开班式上强调，要深刻认识农业供给侧结构性改革的重大意义，深入贯彻落实农业供给侧结构性改革的部署要求，加快释放农业科技支撑新动能，把握农业生物技术与安全管理工作重点，提升安全监管工作和科普宣传工作的针对性和有效性。\r\n\r\n　　张桃林强调，要切实把农业供给侧结构性改革引向深入，在促进数量平衡的同时，注重提升质量效益；在调整生产结构的同时，注重优化产业结构、经营结构；在突出发展生产力的同时，注重体制机制改革创新。正确处理好调结构与稳粮食、稳产量与强产能、抓生产与保生态、市场与政府、规模经营与小农经营等关系，推进结构调整，推进绿色发展，推进创新驱动，推进农村改革，稳定粮食生产。\r\n\r\n　　张桃林指出，推动农业供给侧结构性改革，对农业科技在节本、高效、智能、绿色等方面提出了更高的要求。\u201c十三五\u201d期间，农业科技工作要在调整科技创新方向、优化科技资源布局、拓展科技创新领域、壮大农业科技力量、深化科技体制改革等方面狠下功夫。今年的重点工作是，强化国家农业科技创新联盟建设，建设一批现代农业产业科技创新中心，实施农业竞争力提升科技行动，深入推进农业科技体制机制改革，组织实施农业基础性长期性科技工作，深化农技推广体系改革。\r\n\r\n　　张桃林要求，转基因工作专业性强、涉及面广、关注度高，必须科学认识、理性对待、正确把握、依法管理，推进转基因研究与应用健康稳定发展。做好转基因安全监管，各级农业行政主管部门领导要亲自抓、负总责，在春耕备耕、秋收冬种等关键时节，抓关键环节和重点区域，加强检查督查。加强科普宣传，科学发声，主动发声，经常发声，多用老百姓听得懂的语言讲科学故事，抓住领导干部这个关键少数、农业干部这个骨干队伍、青年学生这个活跃群体，不断增强广大公众对转基因技术的科学认识。\r\n","creattime":"2017-04-06","urlFiles":null,"type":null,"url":null,"urlPics":null},{"id":46,"title":"8","content":"fdasfdafd范德萨发","creattime":"2017-04-06","urlFiles":null,"type":null,"url":null,"urlPics":null},{"id":47,"title":"9","content":"fdasfdafd范德萨发","creattime":"2017-04-06","urlFiles":null,"type":null,"url":null,"urlPics":null},{"id":48,"title":"10","content":"fdasfdafd范德萨发","creattime":"2017-04-06","urlFiles":null,"type":null,"url":null,"urlPics":null},{"id":49,"title":"11","content":"fdasfdafd范德萨发","creattime":"2017-04-06","urlFiles":null,"type":null,"url":null,"urlPics":null},{"id":50,"title":"12","content":"fdasfdafd范德萨发","creattime":"2017-04-06","urlFiles":null,"type":null,"url":null,"urlPics":null},{"id":51,"title":"13","content":"fdasfdafd范德萨发","creattime":"2017-04-06","urlFiles":null,"type":null,"url":null,"urlPics":null},{"id":52,"title":"14","content":"fdasfdafd范德萨发","creattime":"2017-04-06","urlFiles":null,"type":null,"url":null,"urlPics":null}]
     */

    private PageBean page;
    private List<ContentBean> content;

    public PageBean getPage() {
        return page;
    }

    public void setPage(PageBean page) {
        this.page = page;
    }

    public List<ContentBean> getContent() {
        return content;
    }

    public void setContent(List<ContentBean> content) {
        this.content = content;
    }

    public static class PageBean {
        /**
         * hasPrePage : false
         * hasNextPage : true
         * everyPage : 15
         * totalPage : 2
         * currentPage : 1
         * beginIndex : 0
         * totalCount : 18
         * data : null
         * datas : null
         */

        private boolean hasPrePage;
        private boolean hasNextPage;
        private int everyPage;
        private int totalPage;
        private int currentPage;
        private int beginIndex;
        private int totalCount;
        private Object data;
        private Object datas;

        public boolean isHasPrePage() {
            return hasPrePage;
        }

        public void setHasPrePage(boolean hasPrePage) {
            this.hasPrePage = hasPrePage;
        }

        public boolean isHasNextPage() {
            return hasNextPage;
        }

        public void setHasNextPage(boolean hasNextPage) {
            this.hasNextPage = hasNextPage;
        }

        public int getEveryPage() {
            return everyPage;
        }

        public void setEveryPage(int everyPage) {
            this.everyPage = everyPage;
        }

        public int getTotalPage() {
            return totalPage;
        }

        public void setTotalPage(int totalPage) {
            this.totalPage = totalPage;
        }

        public int getCurrentPage() {
            return currentPage;
        }

        public void setCurrentPage(int currentPage) {
            this.currentPage = currentPage;
        }

        public int getBeginIndex() {
            return beginIndex;
        }

        public void setBeginIndex(int beginIndex) {
            this.beginIndex = beginIndex;
        }

        public int getTotalCount() {
            return totalCount;
        }

        public void setTotalCount(int totalCount) {
            this.totalCount = totalCount;
        }

        public Object getData() {
            return data;
        }

        public void setData(Object data) {
            this.data = data;
        }

        public Object getDatas() {
            return datas;
        }

        public void setDatas(Object datas) {
            this.datas = datas;
        }
    }

    public static class ContentBean {
        /**
         * id : 38
         * title : 上半年主要农作物病虫害发生趋势
         * content : 根据各县（市）区植保站在2月24日至3月1日对主要农作物病虫害越冬基数调查结果，结合历年资料、参照气象资料对今年上半年我市主要农作物病虫害发生趋势预测。
         * creattime : 2017-04-06
         * urlFiles : /resources/uploads/laws/file/201704/20170406170014_832.zip
         * type : 1
         * url :
         * urlPics :
         */

        private int id;
        private String title;
        private String content;
        private String creattime;
        private String urlFiles;
        private int type;
        private String url;
        private String urlPics;

        public int getId() {
            return id;
        }

        public void setId(int id) {
            this.id = id;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getContent() {
            return content;
        }

        public void setContent(String content) {
            this.content = content;
        }

        public String getCreattime() {
            return creattime;
        }

        public void setCreattime(String creattime) {
            this.creattime = creattime;
        }

        public String getUrlFiles() {
            return urlFiles;
        }

        public void setUrlFiles(String urlFiles) {
            this.urlFiles = urlFiles;
        }

        public int getType() {
            return type;
        }

        public void setType(int type) {
            this.type = type;
        }

        public String getUrl() {
            return url;
        }

        public void setUrl(String url) {
            this.url = url;
        }

        public String getUrlPics() {
            return urlPics;
        }

        public void setUrlPics(String urlPics) {
            this.urlPics = urlPics;
        }
    }
}
