package cn.org.nercita.agriculturalconsultant.main.bean;

import java.util.List;

/**
 * Created by 梁兴胜 on 2017/4/14.
 * 农业资讯更多列表
 */

public class MarkNewsListBean {

    /**
     * page : {"hasPrePage":false,"hasNextPage":true,"everyPage":15,"totalPage":8,"currentPage":1,"beginIndex":0,"totalCount":106,"data":null,"datas":null}
     * content : [{"id":1403,"title":"河北石家庄鸡蛋价格弱势企稳","content":"\u201c十一黄金周\u201d过后，鸡蛋价格一直持续下降，从5元时代降至3元时代。不过，近段时间以来，鸡蛋价格终于企稳。近日，记者走访省会石家庄部分农贸市场及超市发现，每斤鸡蛋的零售价格多维持在3.5元-3.8元/斤。","createDate":1463385025000,"originalUrl":"http://www.agronet.com.cn/News/1092670.html","imgSrc":"uploads/trading/jidan.jpg","oldid":323869},{"id":304,"title":"下月起食盐价格将放开","content":"为保证畜产品质量安全，保障全县人民吃上\u201c放心肉\u201d，唐县农业局多措并举，进一步强化定点屠宰监管，防止染疫、病害畜产品流入市场。\r\n\r\n　　一是实行驻场官方兽医负责制。对？？隆等定点屠宰场派驻官方兽医，坚持24小时检疫监管，严格履行检疫工作管理制度，规范检疫操作，确保工作措施到位，责任到人。\r\n\r\n　　二是严格入场查证验物。按照《动物检疫管理办法》和《生猪屠宰检疫规程》的规定，做好动物入场查证验物工作，并认真做好\u201c瘦肉精\u201d监督抽检工作，对检验不符合规定的，一律不得入场。要求证物相符，对无检疫证明和没佩戴耳标的动物，根据情况转送隔离间和急宰间，杜绝病害动物进入定点屠宰环节。\r\n\r\n竹盐、海盐、精盐，低钠、低碘\u2026\u2026如今，在省会各大连锁超市，食盐品种琳琅满目。\r\n记者日前从省物价局了解到，根据国家相关要求及通知，从2017年1月1日起，全省将放开食盐出厂、批发和零售价格，由企业根据生产经营成本、食盐品质、市场供求状况等因素自主确定。这意味着食用盐价格将从政府定价走向市场调节，外地盐业可进入省会市场销售，盐品种类将更加丰富，可进一步满足市民的多样化需求。","createDate":1463124301000,"originalUrl":"http://nc.mofcom.gov.cn/articlexw/xw/dsxw/201612/19092381_1.html","imgSrc":"uploads/trading/shiyan.jpg","oldid":323773},{"id":303,"title":"上周食用农产品和生产资料价格小幅上涨","content":"据商务部监测，上周（11月21日至27日）全国食用农产品市场价格指数比前一周上涨0.7%，生产资料市场价格指数比前一周上涨1.7%。","createDate":1463124300000,"originalUrl":"http://www.sjznc.gov.cn/col/1437037384529/2016/12/01/1480551716780.html","imgSrc":"uploads/trading/shucai.jpg","oldid":323771},{"id":305,"title":"俄罗斯期盼外资投入发展本国水产业","content":"据Intrafish 5月5日报道：俄罗斯代表团及水产企业参加了在布鲁塞尔举办的渔业展会，旨在吸引海外投资，维护本国市场经济，与欧盟企业签约，更多的向其出口海产品。俄方企业表示他们的生产采用国际标准，并以做好充分准备向海外市场出口，特别是欧洲地区。与会企业也表示，目前本国市场对海产品的需求不容小觑，越来越多的本地居民希望购买到高品质的海产品。     俄方的拖网渔船企业Nakhodka Active Marine Fishery base公司表示，如果俄方可以拥有现代化的物流服务、现代化的冷藏装置、港口基础设施完善，那么将可实现两周内完成从俄罗斯向欧洲地区的海产品出口贸易，而今，对欧洲地区的出口运输时间长达50天，甚至更长。     在展会期间，俄方代表团展示出十分期盼投资者加入的心愿。这是近年来俄罗斯首次派出代表团和企业参与大型渔业展会。（中国国际渔业博览会）出处：中国国际渔业博览会","createDate":1463124300000,"originalUrl":"http://fishery.zjnw.gov.cn/scpltjg/hyzx/hydt/2016/05/09/2016050900009.shtml","imgSrc":null,"oldid":323772},{"id":201,"title":"农业部部长：着力优化调整农业结构 切实抓好小麦等夏季粮油生产","content":"　　5月7~8日，农业部部长韩长赋在河北调研时强调，各级农业部门要认真学习贯彻习近平总书记在安徽省凤阳县小岗村主持召开的农村改革座谈会上的重要讲话精神，大力推进农业供给侧结构性改革，着力优化调整农业结构，统筹抓好小麦田间管理工作，全力以赴夺取夏季粮油好收成；地下水超采地区要把压井减水和结构调整、探索耕地轮作休耕制度结合起来，在稳定粮食核心区产能的基础上，发展节水增效、适产适销的农业产业，促进农业可持续发展。<?xml:namespace prefix = o ns = \"urn:schemas-microsoft-com:office:office\" />\n　　5月的燕赵大地，小麦开始扬花灌浆，正是农业生产的关键时期。韩长赋深入到沧州市和石家庄市部分县市的田间、村庄、农场，同小麦专家、干部群众等交谈，了解农业结构调整、农业节水、麦田管理等相关工作，认真听取大家的意见和建议。\n　　农业结构调整是今年农业工作的主旋律，事关农业可持续发展和促进农民增收，韩长赋非常关心，特地来到地下水超采地区了解农业结构调整情况。在沧州市献县乐寿镇，韩长赋走进子牙花海的油菜田间，和种植户交谈，查看旱作冬油菜等种植情况。基层干部介绍，县里利用地下水超采治理项目，开展种植结构调整试点，给油菜种植户每亩400元补贴，打造万亩\u201c油菜+油葵\u201d连作的农业旅游观光带。油菜油葵连作，年减少灌溉2-3次，亩节水100立方米以上，实现生态节水和农民增收。随后，韩长赋来到献县十五级乡八章村俊太家庭农场，了解地下水超采综合治理项目季节性休耕情况。负责人赵俊太介绍说，农场实施调整农业种植模式项目870亩，每亩获得补贴500元，改小麦、玉米连作为一季休耕和一季雨养玉米，年减少灌溉3-4次，亩节水180立方米，项目实施后收益略高于实施前。韩长赋指出，调整种植结构是地下水超采治理的重要途径和措施，在探索研究节水减水同时，还要不减少农民收入，达到既保护农业资源环境，又稳定产能、节本增收的目的。要在地下水超采地区率先开展轮作休耕制度试点，通过试点形成一套有效的长效机制，确保在地下水超采项目实施期结束后，节水和增收的好势头不逆转。据悉，为推进农业节水，河北省今年在黑龙港地下水漏斗区实行季节性休耕试点，调减冬小麦104万亩，由冬小麦夏玉米一年两熟改为一年一熟的玉米、杂粮、杂豆等作物。\n　　石家庄市所辖的辛集市新垒头镇马兰农场，是石家庄市农林科学院的小麦品种试验基地。\n　　韩长赋走进小麦节水品种选育基地、新品种展示田，查看不同品种不同浇水次数的小麦长势，询问节水品种用水和产出等情况。石家庄市农林科学院研究员、小麦专家郭进考正在田间做实验。韩长赋每年都和他就小麦生产有关问题深入讨论，称他是自己\u201c麦田里的朋友\u201d。郭进考带领韩长赋一行走进试验田旁深挖的大坑，通过土壤剖面了解节水小麦根系生长情况。当了解到节水品种浇一水和浇两水的产量差别不大时，韩长赋对他们选育的节水品种表现出浓厚兴趣，希望研究人员再接再厉，多培育抗旱节水小麦品种，争取小麦生产能够少用水不减产，把成本降下来，缓解资源环境压力，努力做到藏粮于地、藏粮于技。韩长赋指出，农业节水是个大课题，要坚持把推广节水品种和农艺节水、工程节水、种植结构调整相结合，提高水资源利用率，提高农业效益。当前，小麦生产进入中后期生长的关键时节，农业部门要加大指导服务，狠抓关键措施落实，强化田间管理，大力开展小麦\u201c一喷三防\u201d，保粒数，增粒重，同时要做好农机等检修工作，为小麦收获做好充分准备，力争今年夏季粮油再获好收成。","createDate":1462896000000,"originalUrl":"http://www.gsqynm.com/ReadNews.asp?NewsID=11046","imgSrc":"","oldid":323748},{"id":202,"title":"政策粮积极入市，华北玉米市场何去何从？","content":"　　从4月份开始，全国各地轮换玉米就陆续开始出库，价格基本随行就市，因质量稍差于新粮，普遍略低于新粮价格。进入5月份，随着临储收购以12543万吨\u201c天量\u201d完美收官，市场贸易粮源逐渐陷入趋紧局面，尤其是东北地区。目前东北基层粮源基本售罄，轮换玉米成为东北市场供应主力。华北市场余粮有限，轮换玉米出库节奏呈现增加趋势。此外，北方港口粮源基本以轮换玉米为主，销区市场轮换玉米持续供应。整体来看，5月份市场新粮逐渐见底，各地轮换玉米供应占比有所增加，国家去库存\u201c序幕\u201d逐步拉开。 \n　　从部分地区轮换玉米价格变动以及地储拍卖成交结果来看，5月份政策粮入市节奏有所加快，市场对轮换玉米采购数量也有所上升。此前市场传言5月5日中储粮吉林分公司开会决定将林玉米轮换出库价格从1750元/吨下调到1680元/吨，并执行阶梯优惠。在轮换玉米占据东北市场主要供应地位的情况下，中储粮主动降价，或表明政府将加大去库存力度。 \n　　从春节以后各地拍卖情况来看，3月份部分地区进行的玉米地储拍卖全部流拍；4月下旬在四川和北京举行的拍卖成交率开始增加，成交均价较市场价格均偏低；5月6日在吉林地区进行的省级储备粮轮换竞价销售交易会上，玉米拍卖成交率为23.45%，均为溢价成交。以上拍卖结果表明，前期政府拍卖多为试探市场可接受的价格区间，随着拍卖价格逐渐接近市场价格甚至低于市场价格，配合市场粮源陆续减少，拍卖成交率与成交数量呈现增加趋势。 \n　　此外，传闻目前山东辖区转储玉米共159.32万吨已全部签订销售合同，销售均价1628元/吨，而广东各粮库2013年轮换玉米销售已达80%以上，这些玉米的销售主体既有企业也有部分贸易商，鉴于国家去库存压力较大以及企业库存偏低，预计5月份各地轮换玉米出库节奏将继续加快。 \n　　政策粮加大力度供应市场，对当前华北玉米市场又会产生怎样的影响呢？春节前后开始，由于临储收购力度空前，恰逢东北、华北玉米价差较大，华北玉米在一段时间内\u201c北上南下\u201d持续供应国内大部分市场，但受市场各方主体悲观预期以及需求偏弱影响，华北玉米价格却并未因此受到支撑。从下图可以看出，2016年以来华北地区玉米价格整体呈现下跌趋势，其中春节之后价格下跌幅度较大。但3月份之后，华北玉米价格整体维持在1600-1650元/吨之间震荡，4月中下旬基本完成短期筑底，之后呈现反弹走势。 \n　　当前，华北基层余粮已经有限，粗略估计约剩两成左右。虽然随着前两次华北价格反弹，农户低价惜售情绪已经有所缓解，但由于粮源分布不均，个别地区市场粮源趋紧局面已初现端倪，而近期价格反弹在很大程度上是由于企业上量减少所致。受此影响，部分企业与贸易商备货心态逐渐开始转变，当前贸易商与企业库存均有限，预计5月份企业备库需求或将有所增加，华北市场价格底部受到支撑。 \n　　另一方面，6月份华北市场小麦即将收割，部分农户准备为麦收滕库，5月下旬市场或将出现一波传统售粮小高峰，加之轮换玉米供应持续增加，5月份市场供应或难以出现缺口。而从需求来看，目前用粮企业对国内玉米需求仍显疲软。在南北市场轮换玉米同时供应下，华北玉米供应范围缩小，南方销区大型企业多有轮换玉米签单，企业采购心态仍以随用随采为主。此外，当前进口谷物与替代品库存充足，对国内玉米需求产生一定冲击。根据官方统计数据，3月份生猪存栏环比数据止跌回升，同比跌幅有所缩窄，但生猪存栏增幅有限，下游市场对玉米需求并未产生明显提振作用。因此，预计华北市场价格继续反弹动能不足。 \n　　综上所述，5月份华北市场仍以贸易粮源与轮换玉米同时供应为主，其中贸易粮源仍占主导地位，轮换玉米则配合市场起到调节价格的作用，同时考虑整体需求环境以及进口作物替代等因素，5月份华北市场玉米价格上行动能不足与下行价格受到支撑并存，因此玉米后期走势或为区间震荡概率较大。","createDate":1462896000000,"originalUrl":"http://www.hljagri.gov.cn/fxyc/zh/201605/t20160511_675977.htm","imgSrc":null,"oldid":323744},{"id":203,"title":"天津建设国际海水淡化与综合利用产业高地","content":"由国家海洋局天津海水淡化与综合利用研究所负责整体实施的临港海水淡化与综合利用示范基地，计划于下月开工建设，2017年底主体竣工。该基地投入使用后，依托其自主创新成果，海水淡化与综合利用成本可大大降低，同时带动装备制造、水处理等相关产业发展，助力临港成为国际海水淡化与综合利用产业高地。    临港海水淡化与综合利用示范基地将以智慧型创新服务平台为支撑，实施\u201c两区两带\u201d工程。其中，\u201c两区\u201d为科技创新区和产业集聚区，\u201c两带\u201d为创新协同带和产业协同带。该基地占地25万平方米，总投资18.25亿元，将依托临港经济区临海优势、具备大型试验取排海水的便利条件，规划建设具备科研开发、检测评价、孵化转化、勘察设计、交流培训、信息集成六大功能区域，为发展海水淡化产业提供重要支撑。    据了解，该基地将提升10万吨级以上海水淡化工程自主装备设计、百万吨级工程系统集成能力，发展浓海水综合利用产业链开发利用技术，开发多种高值化产品，向三大海水利用技术领域延伸，包括海水淡化、海水直接利用和海水化学资源利用，力争建成国家海水淡化与综合利用重点实验室。同时，基地还将依托国家海水利用工程技术研究中心建设，搭建国内外海水利用成果转化的平台和孵化器，打造系列化杀手锏产品，服务企业发展；吸引产业集聚，形成以淡化所为核心的产业联盟，并成为行业的龙头和引领者。    根据规划，未来，该基地还将建成国家海水淡化与综合利用技术装备评测中心，建立健全检验检测标准体系，扩大检测资质范围，强化膜产品、装备、水质等方面的检测能力，与国际接轨。此外在滨海新区建设占地500余亩的海水淡化与综合利用创新及产业化基地，搭建海水淡化与综合利用创新服务平台，上马独具特色的研究手段和尖端实验设备，实现大型装备及系统的研发、试验和测试，为产业发展提供支撑。（天津日报）出处：天津日报","createDate":1462260300000,"originalUrl":"http://fishery.zjnw.gov.cn/scpltjg/hyzx/hydt/2016/05/03/2016050300025.shtml","imgSrc":null,"oldid":323546},{"id":204,"title":"青岛海关破获冻水产品走私系列案 案值4.6亿元","content":"青岛海关近日破获一起冻水产品走私系列案，一举捣毁涉嫌走私冻水产品团伙3个，初估涉案走私冻水产品3万余吨，案值约4.6亿元。    据青岛海关缉私局通报称，2015年10月，青岛海关组织对进口的美国冻鱿鱼低报价格、堵塞风险开展分析研判。分析发现，青岛关区进口的美国冻鱿鱼在全国占比高达40%，但部分企业申报单价比较集中，并且长期不变，与美国市场行情不相符，随即围绕重点企业人员开展了专项核查。随着核查工作的不断深入，张某某、马某某和化某某三个走私团伙逐渐浮出水面。    相关的证据显示，涉案团伙与外商签订合同之后，自行制作虚假的报关单据，把真实成交价格为1.6到1.8美元每公斤的美国冻鱿鱼伪报成1.1到1.3美元每公斤，差额贷款通过离岸账户等渠道对外支付。    今年3月7号，青岛海关组成青岛\u201c利剑\u201d1610专案组分24个行动组在青岛、大连、烟台、日照四地多点突击，刑事办案人员根据前期掌握的证据情况，一举抓获三个犯罪团伙全部11名犯罪嫌疑人，联合稽查作业人员对其他重点嫌疑企业实施径行稽查，又查发案件4起，抓获犯罪嫌疑人4名。随即，各行动组对犯罪嫌疑人住所和办公场所进行搜查取证，获取大量走私证据。    现已初步查明，犯罪团伙采取制作、虚假单证等方式，低报价格、偷逃国家税款，从美国大肆进口冻鱿鱼、冻马面鱼、冻鲽鱼等，并在青岛、大连、日照等地消除毛利，案值大约4.6亿元。\n （中国广播网）出处：中国广播网","createDate":1462260300000,"originalUrl":"http://fishery.zjnw.gov.cn/scpltjg/hyzx/hydt/2016/05/03/2016050300021.shtml","imgSrc":null,"oldid":323548},{"id":222,"title":"杭帮菜大赛20道特色菜点有水产11道","content":"2016年2~4月，由39家宾馆酒店、98个参赛团组及375名选手参赛的杭帮菜烹饪大赛，22日上午在中国杭帮菜博物馆推选出20道最具杭州特色的菜点，其中涉及水产的有11道。可见，水产品高蛋白、低脂肪，富含多种氨基酸和ω-3脂肪酸，吃鱼健脑，有利于预防心脑血管疾病，已成为人们的共识，水产品已成为人们餐桌上的美味佳肴。    据大赛裁判家介绍，每家参赛饭店都要制作16道具有杭州特色的菜点，包括6道冷菜、6道热菜和4道点心；每桌总成本要控制在2000元以内，不提倡高档原材料，更不准使用人造色素、野生动物和鱼翅。    推选出的20道最具杭州特色的菜点，其中16道菜肴分别是：西湖醋鱼、龙井虾仁、东坡焖肉、叫花童鸡、干炸响铃、香烤鲳鱼、西湖鱼圆、蜜汁火方、南宋蟹酿橙、双味帝皇蟹、鳕鱼狮子头、抹茶焗大虾、笋干老鸭煲、粽香花溪鳖、千岛扒鱼脸、糯米藕；另有4道点心：桂花水晶糕、蟹黄小笼包、龙井问茶、木莲芯。这20道菜点中含有水产的有11道杭州特色的菜点。出处：协会秘书处","createDate":1462260300000,"originalUrl":"http://fishery.zjnw.gov.cn/scpltjg/hyzx/hydt/2016/04/26/2016042600002.shtml","imgSrc":null,"oldid":323550},{"id":238,"title":"关于召开第八届中国对虾产业发展研讨会的通知","content":"各有关单位：     对虾是我国最早形成大规模产业的水产养殖品种之一，产业发展经历了高速增长期、出口依赖期、内销转型期。如今对虾产业将面临的挑战来自多方面，对虾产业正进入变革期，国内外市场波动，中国对虾产业的后市发展引起了业界的广泛关注。    在此背景下，我会定于今年4月19日在杭州市召开\u201c第八届中国对虾产业发展研讨会\u201d。大会将围绕\u201c对虾产业转型升级，有效应对产业危局\u201d的主题，邀请国内领域内的权威专家，探讨我国对虾产业处境和转型方式、国内外市场变化、养殖模式转型、内销市场拓展，及未来发展方向等问题，引导对虾产业健康有续发展。现诚邀业界人士参加会议，有关事宜通知如下：    一、会议时间    4月18日报到，19-20日会议    二、会议地点    杭州萧山宝盛宾馆（杭州萧山区市心中路618号）    三、会议主题    对虾产业转型升级，有效应对产业危局    四、组织机构    （一）主办单位    中国水产流通与加工协会    （二）承办单位    中国水产流通与加工协会对虾分会    （三）协办单位    国家虾产业技术体系、湛江水产进出口企业协会、浙江省水产流通与加工协会、广东省水产流通与加工协会、海南省水产流通与加工协会、河北省水产流通与加工协会、中国水产频道、全国工商联水产业商会。    （四）媒体支持    《中国水产》、《中国渔业报》、《科学养鱼》、《中国水产品》、南方农村报、《农财宝典》、《水产前沿》、《当代水产》、《海洋与渔业》、中国水产频道、中国食品商务网、新渔网、中国水产门户网、腾氏水产商务网、中国水产养殖网、海鲜指南    五、会议注册：    为便于会务安排，请于4月13日前进行网上报名。    现场缴纳注册费：1500元/人，4月 13日前通过网络注册并电汇会议注册费的会议代表：1000元/人，住宿自理。银行汇款：开户行：中国农业银行北京朝阳路北支行    账  号：11040101040004564    户  名：中国水产流通与加工协会    联系人：张琳琳、李凯杰，电话：010-65062912/85274846；    传  真:010-85274847， E-mail：cappma_sublliance@163.com出处：","createDate":1462260300000,"originalUrl":"http://fishery.zjnw.gov.cn/scpltjg/hyzx/hydt/2016/04/16/2016041600014.shtml","imgSrc":null,"oldid":323549},{"id":221,"title":"黑龙江省农作物病虫预报 第2期","content":"<?xml:namespace prefix = v ns = \"urn:schemas-microsoft-com:vml\" />\n<?xml:namespace prefix = o ns = \"urn:schemas-microsoft-com:office:office\" />农作物病虫预报\n  黑龙江省植检植保站\n地址：哈尔滨市珠江路21号  电话：(0451)-82340905     第二期\nE-mail：hljcebao@sina.com 传真：(0451)-82310538   <?xml:namespace prefix = st1 ns = \"urn:schemas-microsoft-com:office:smarttags\" />2016年4月29日\n注意预防水稻苗床病害\n今年我省春季气温变化幅度较大，冷暖空气活动频繁，升、降温过程明显，特别是近期温度骤升，易造成秧苗徒长，抗病性降低，加之个别稻农苗床管理不当，目前部分地区水稻苗床已有病害零星发生。据近日各水稻主产县植保站调查监测，肇源立枯病发病棚室率3.3%，发病棚病株率0.1%；肇东、泰来、富锦零星发生。阿城、密山、北林、绥棱零星发生绵腐病，五常、富锦个别苗床零星发生恶苗病，阿城、庆安、桦南等地个别苗床还出现除草剂药害等造成的白苗现象。\n目前我省各地水稻秧苗已陆续进入2～3叶期，胚乳营养耗尽，是抗病力最差时期，也是苗床管理和防病的关键期，各地应高度重视水稻苗床病害的监测和防治工作，密切关注天气情况，及时准确发布预报，指导稻农加强苗床管理，科学通风炼苗，及时用药防治，确保水稻苗齐、苗壮。\n防治建议：\n1、防治青、立枯病。加强苗床温湿度的科学管理，适时通风炼苗，提高秧苗素质，减轻病害发生。在发病初期及时喷药防治，每平方米苗床用30%甲霜??霉灵水剂3～4毫升，对水3公斤浇施。喷施后要及时洗苗，防止药剂烧苗。\n2、防治苗床绵腐病。出现中心病株后，用25%甲霜灵可湿性粉剂800倍液～1000倍液，及时喷雾防治。\n3、缓解苗床除草剂药害。可喷施芸苔素内酯加多元优质叶面肥1-2遍，用药间隔7-10天，增强秧苗的自愈能力。叶面肥和植物生长调节剂应选用已在农业部登记，且信誉好、产品质量可靠的正规企业生产的产品。\n \n \n \n \n \n\n\n发送单位：农业部种植业管理司植保处、全国农业技术推广服务中心测报处、防治处，各市（地）、县（市、区）植保站。   \n拟稿：张齐凤 王春荣   核稿：宋显东      签发：陈继光    印发：120份","createDate":1462175413000,"originalUrl":"http://www.hljpps.com/news/content.asp?id=1340","imgSrc":null,"oldid":323525},{"id":218,"title":"2016年5月1日安丘洋葱市场最新报价","content":"潍坊安丘： \n　　云南、四川、河南鲜葱：\n　　　　黄葱7.0cm以上：0.60-0.70元/市斤。","createDate":1462080003000,"originalUrl":"http://www.dasuan5.com/garlic-123461-1.html","imgSrc":null,"oldid":323469},{"id":219,"title":"2016年5月1日山东聊城洋葱市场最新报价","content":"山东聊城大张：\n　　冷库：\n　　　　二红7.0?以上：1.40元/市斤左右。","createDate":1462080003000,"originalUrl":"http://www.dasuan5.com/garlic-123451-1.html","imgSrc":null,"oldid":323470},{"id":220,"title":"5月1日济宁金乡食品工业园最新蒜片价格","content":"济宁金乡食品工业园区：\n　　15年四六瓣蒜片：22500元/吨左右（质量好）。\n　　15年杂交蒜片：21000元/吨左右（质量好）。\n　　15年杂交蒜片：20500元/吨左右（质量一般）。\n　　15年中期蒜芯片：19500元/吨左右。\n　　15年三级米生产蒜片：18000元/吨左右。\n　　冷库存放冷库蒜生产蒜片：20000元/吨左右。\n　　有大量现货，欢迎来电采购。","createDate":1462080003000,"originalUrl":"http://www.dasuan5.com/garlic-123458-1.html","imgSrc":null,"oldid":323471},{"id":211,"title":"5月1日河北邯郸最新蒜片价格","content":"河北河北邯郸：\n　　2015年四六瓣新片：21000-21500元/吨。\n　　蒜粉：8000-19000元/吨。\n　　蒜粒：20000-23000元/吨。","createDate":1462080002000,"originalUrl":"http://www.dasuan5.com/garlic-123445-1.html","imgSrc":null,"oldid":323462}]
     */

    private PageBean page;
    private List<ContentBean> content;

    public PageBean getPage() {
        return page;
    }

    public void setPage(PageBean page) {
        this.page = page;
    }

    public List<ContentBean> getContent() {
        return content;
    }

    public void setContent(List<ContentBean> content) {
        this.content = content;
    }

    public static class PageBean {
        /**
         * hasPrePage : false
         * hasNextPage : true
         * everyPage : 15
         * totalPage : 8
         * currentPage : 1
         * beginIndex : 0
         * totalCount : 106
         * data : null
         * datas : null
         */

        private boolean hasPrePage;
        private boolean hasNextPage;
        private int everyPage;
        private int totalPage;
        private int currentPage;
        private int beginIndex;
        private int totalCount;
        private Object data;
        private Object datas;

        public boolean isHasPrePage() {
            return hasPrePage;
        }

        public void setHasPrePage(boolean hasPrePage) {
            this.hasPrePage = hasPrePage;
        }

        public boolean isHasNextPage() {
            return hasNextPage;
        }

        public void setHasNextPage(boolean hasNextPage) {
            this.hasNextPage = hasNextPage;
        }

        public int getEveryPage() {
            return everyPage;
        }

        public void setEveryPage(int everyPage) {
            this.everyPage = everyPage;
        }

        public int getTotalPage() {
            return totalPage;
        }

        public void setTotalPage(int totalPage) {
            this.totalPage = totalPage;
        }

        public int getCurrentPage() {
            return currentPage;
        }

        public void setCurrentPage(int currentPage) {
            this.currentPage = currentPage;
        }

        public int getBeginIndex() {
            return beginIndex;
        }

        public void setBeginIndex(int beginIndex) {
            this.beginIndex = beginIndex;
        }

        public int getTotalCount() {
            return totalCount;
        }

        public void setTotalCount(int totalCount) {
            this.totalCount = totalCount;
        }

        public Object getData() {
            return data;
        }

        public void setData(Object data) {
            this.data = data;
        }

        public Object getDatas() {
            return datas;
        }

        public void setDatas(Object datas) {
            this.datas = datas;
        }
    }

    public static class ContentBean {
        /**
         * id : 1403
         * title : 河北石家庄鸡蛋价格弱势企稳
         * content : “十一黄金周”过后，鸡蛋价格一直持续下降，从5元时代降至3元时代。不过，近段时间以来，鸡蛋价格终于企稳。近日，记者走访省会石家庄部分农贸市场及超市发现，每斤鸡蛋的零售价格多维持在3.5元-3.8元/斤。
         * createDate : 1463385025000
         * originalUrl : http://www.agronet.com.cn/News/1092670.html
         * imgSrc : uploads/trading/jidan.jpg
         * oldid : 323869
         */

        private int id;
        private String title;
        private String content;
        private long createDate;
        private String originalUrl;
        private String imgSrc;
        private int oldid;

        public int getId() {
            return id;
        }

        public void setId(int id) {
            this.id = id;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getContent() {
            return content;
        }

        public void setContent(String content) {
            this.content = content;
        }

        public long getCreateDate() {
            return createDate;
        }

        public void setCreateDate(long createDate) {
            this.createDate = createDate;
        }

        public String getOriginalUrl() {
            return originalUrl;
        }

        public void setOriginalUrl(String originalUrl) {
            this.originalUrl = originalUrl;
        }

        public String getImgSrc() {
            return imgSrc;
        }

        public void setImgSrc(String imgSrc) {
            this.imgSrc = imgSrc;
        }

        public int getOldid() {
            return oldid;
        }

        public void setOldid(int oldid) {
            this.oldid = oldid;
        }
    }
}
